098_Мастер_Ра_разработка/src/Documents/РасходныйКассовыйОрдер/РасходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходныйКассовыйОрдер</name>
  <basedOn>Document.ПрочиеЗатраты</basedOn>
  <registerRecords>AccumulationRegister.ПланируемыеПрочиеЗатраты</registerRecords>
  <registerRecords>AccumulationRegister.Касса</registerRecords>
  <attributes>
    <name>ВидПлатежа</name>
    <type>
      <types>EnumRef.ФормыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЗатраты</name>
    <type>
      <types>DocumentRef.ПрочиеЗатраты</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаСчет</name>
    <type>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>КодыЗаказов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентБренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеРасхода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтатьиРасхода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОригиналПолучен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВБУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статусы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>CatalogRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПрихода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.Заявка</types>
      </type>
    </attributes>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>CatalogRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтатьиРасхода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поступления</name>
    <attributes>
      <name>Поступление</name>
      <type>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Приходники</name>
    <attributes>
      <name>ПКО</name>
      <type>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

098_Мастер_Ра_разработка/src/Enums/Статусы/Статусы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Статусы</name>
  <enumValues>
    <name>Вработе</name>
  </enumValues>
  <enumValues>
    <name>Готов</name>
  </enumValues>
  <enumValues>
    <name>ДебиторкаПросрочена</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>ЗаполненаСОшибкой</name>
  </enumValues>
  <enumValues>
    <name>НаСогласованииЗаказчика</name>
  </enumValues>
  <enumValues>
    <name>НетДокументов</name>
  </enumValues>
  <enumValues>
    <name>ПеределкаЗаказа</name>
  </enumValues>
  <enumValues>
    <name>Проверен</name>
  </enumValues>
</mdclass:Enum>

098_Мастер_Ра_разработка/src/Documents/РасходныйКассовыйОрдер/Forms/ФормаДокумента/Module.bsl
// @strict-types


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(Объект.ДокументЗатраты) Тогда 
		Если ЗначениеЗаполнено(Объект.ДокументЗатраты.ДокументОплаты) Тогда 
			ДокументЗатраты = Объект.ДокументЗатраты.ПолучитьОбъект();
			ДокументЗатраты.ДокументОплаты = Объект.Ссылка;
			ДокументЗатраты.Записать();
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыЗаявкаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Заказы.ТекущиеДанные;      
	ТекущиеДанные.кодЗаказа = ПолучитьНомерЗаказ(ТекущиеДанные.Заявка);
КонецПроцедуры

Функция ПолучитьНомерЗаказ(Заявка)
	  Возврат  Заявка.Номер;
КонецФункции	

&НаКлиенте
Процедура ЗаказыСуммаПриИзменении(Элемент)
	РассчитатьСумму();
КонецПроцедуры

Процедура РассчитатьСумму()
	Объект.СуммаДокумента 	= Объект.Заказы.Итог("Сумма");
	Объект.СуммаПрихода 	= Объект.Поступления.Итог("Сумма");
КонецПроцедуры	

&НаКлиенте
Процедура ЗаказыСтатьяРасходовПриИзменении(Элемент)
	текСтрока = ЭтаФорма.Элементы.Заказы.ТекущиеДанные;
	КодМинор = ПолучитьКодМинор(текСтрока.СтатьяРасходов);
	Код      = ПолучитьКод(текСтрока.СтатьяРасходов);
	Если КодМинор=0 Тогда                     
		текСтрока.НомерСтатьиРасхода = Строка(Код);
	иначе	
		текСтрока.НомерСтатьиРасхода = Строка(Код)+"."+Строка(КодМинор);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьКодМинор(СтатьяРасходов)
	Возврат СтатьяРасходов.КодМинор;
КонецФункции

&НаСервере
Функция ПолучитьКод(СтатьяРасходов)
	Возврат СтатьяРасходов.Код;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Для Каждого стрЗаказы из Объект.Заказы Цикл
		Если ЗначениеЗаполнено(стрЗаказы.КодЗаказа) Тогда 
			 тКодЗаказа = стрЗаказы.КодЗаказа;
		 иначе
			тКодЗаказа = ПолучитьНомерЗаказ(стрЗаказы.Заявка); 
		КонецЕсли;	
		Если стрЗаказы.НомерСтроки=Объект.Заказы.Количество() Тогда 
			Объект.КодыЗаказов	= Объект.КодыЗаказов+" "+тКодЗаказа;
		ИначеЕсли стрЗаказы.НомерСтроки=1 Тогда   	
			Объект.КодыЗаказов	= тКодЗаказа+",";
		иначе
			Объект.КодыЗаказов	= Объект.КодыЗаказов+" "+тКодЗаказа+",";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоступлениямиНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоступлениями(Команда)
	ЗаполнитьПоступлениямиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоступленияПоступлениеПриИзменении(Элемент)
	ТекСтрока = Элементы.Поступления.ТекущиеДанные;
	ТекСтрока.Сумма = СуммаПоступления(ТекСтрока.Поступление);
	
	Объект.СуммаПрихода =  Объект.Поступления.Итог("Сумма");

КонецПроцедуры

&НаСервере
Функция СуммаПоступления(Поступление)   
	//290622
   // Если Поступление.НДС_В_томЧисле Тогда 
   //    СуммаДокумента =  Поступление.СуммаДокумента; 
   //Иначе 
   //   	СуммаДокумента = Поступление.СуммаДокумента - Поступление.Товары.Итог("СуммаНДС"); 
   // КонецЕсли;   
    СуммаДокумента =  Поступление.СуммаДокумента;
	
	Возврат СуммаДокумента;
КонецФункции	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Статус) Тогда
		Если Объект.Статус = Перечисления.Статусы.Закрыт И Не РольДоступна("УУ") Тогда 
			ЭтаФорма.ТолькоПросмотр = Истина;
		иначе
			ЭтаФорма.ТолькоПросмотр = Ложь;
		КонецЕсли;	
	иначе	
		Объект.Статус 		= Перечисления.Статусы.Вработе;
		Модифицированность 	= Истина;
	КонецЕсли;
	
	Если Объект.Статус = Перечисления.Статусы.Закрыт Тогда 
		Если Объект.Закрыт = Ложь Тогда  
			Объект.Закрыт 		= Истина;
			Модифицированность 	= Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяРасходовПриИзменении(Элемент)  
	 ВывестиНомерСтатьи()	
КонецПроцедуры

&НаСервере
Процедура ВывестиНомерСтатьи()
	Если Объект.СтатьяРасходов.КодМинор=0 Тогда                     
		Объект.НомерСтатьиРасхода = Строка(Объект.СтатьяРасходов.Код);
	иначе	
		Объект.НомерСтатьиРасхода = Строка(Объект.СтатьяРасходов.Код)+"."+Строка(Объект.СтатьяРасходов.КодМинор);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПослеУдаления(Элемент)
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ПоступленияПослеУдаления(Элемент)
	РассчитатьСумму();
КонецПроцедуры
